doc/project-developing.org
#+title: Developing a Project with Nix Flakes
#+setupfile: internal/links.org

* Org-mode setup :noexport:

** Variables

We set variables in =internal/params.el= and access those settings with the
following macros and source code blocks (using Noweb).

#+name: get
#+begin_src emacs-lisp :var arg="" :eval yes :results silent
(alist-get (intern arg) (car (read-from-string (f-read "internal/params.el"))))
#+end_src

** Setup action

#+name: cleanup
#+begin_src sh :dir .. :results output silent
rm --recursive --force /tmp/my-project
#+end_src

* About this document

This document shows how to get started managing a software project using the
following in conjunction:
- the [[nix][Nix package manager]]
- an experimental feature of Nix called [[nix-flake][flakes]]
- this project, Nix-project.

Nix-project provides library support that helps ease the ergonomics of using Nix
with flakes.

#+begin_quote
*_NOTE:_* To understand more about why to use an experimental feature such as
flakes, as well as known trade-offs, please read the provided [[file:nix-introduction.org][supplemental
documentation on Nix]].
#+end_quote

Nix-project uses all the features it provides itself, so you can look through
this repository for concrete examples of how to do what's discussed in this
document.

* Prerequisites

If you're new to Nix consider reading the provided [[file:nix-introduction.org][introduction]].

If you don't have Nix set up yet, see the provided [[file:nix-installation.org][installation and
configuration guide]]. You will need Nix's experimental flakes feature enabled
to continue following this development guide.

If you don't know how to use basic Nix commands, see the provided [[file:nix-usage-flakes.org][usage guide]].

If you're new to the Nix programming language, see the provided [[file:nix-language.org][language
tutorial]].

* Scaffolding

Nix-project provides a template you can use to scaffold a new project. This
scaffold captures recommended conventions also used by Nix-project itself.

If you want to scaffold a new project set up similarly, you can go into a
writable directory and invoke the following =nix= call:

#+begin_src sh :eval no
nix --extra-experimental-features nix-command \
    --refresh run github:shajra/nix-project/main#nix-scaffold \
    -- --target-dir my-project
#+end_src

#+name: scaffold
#+begin_src sh :dir .. :results output :exports results
nix --refresh run .#nix-scaffold -- --target-dir /tmp/my-project
#+end_src

#+RESULTS: scaffold
: SUCCESS: Scaffolded Nix project at /tmp/my-project

The =--refresh= assures that you get the latest version of the scaffolding
script from the internet if you've made this =nix run= invocation before.

In the freshly scaffolded project, you'll see the following files:

#+name: scaffold-tree
#+begin_src sh :dir /tmp :results output :exports results
tree --noreport my-project
#+end_src

#+RESULTS: scaffold-tree
#+begin_example
my-project
├── default.nix
├── flake.nix
├── nix
│   ├── compat.nix
│   ├── my-app.nix
│   └── overlay.nix
├── README.org
└── support
    └── docs-generate
#+end_example

=README.org= and =support/docs-generate= are used to document your project and
are discussed in [[file:project-documenting.org][another document]].

=default.nix= and =nix/compat.nix= provide non-flakes support for users of your
project who have decided not to enable flakes in their Nix installation. These
are static files that you shouldn't typically have to modify. They expose the
flake defined in =flake.nix= as a Nix expression of packages. The provided [[file:nix-usage-noflakes.org][guide
on using Nix without flakes]] illustrates how end users without flakes can use
the =default.nix= and =nix/compat.nix= files in the scaffolded project.  The
[[file:nix-usage-flakes.org][guide on using Nix with flakes]] will match other user's experience.

You'll modify the top-level =flake.nix= file and the Nix files under the =nix=
directory (with exception of =compat.nix=) to customize the scaffolded project
to your needs.

* Authoring flakes

As documented in the provided [[file:nix-introduction.org][introduction to Nix]], we're using the experimental
flakes feature of Nix for a few reasons:
- more assurances of a deterministic and reproducible build
- faster evaluation from improved caching
- an improved ergonomic experience for authors of Nix projects
- an improved ergonomic experience for end users consuming Nix projects

** Overview of =flake.nix=

The best way to start understanding a flakes-based project is to read the
=flake.nix= file at the project's root. This file is written in the Nix
programming language.  See the provided [[file:nix-language.org][introduction to the Nix language]] if
you're new to the language.

Every =flake.nix= file must conform to a standard structure of an attribute
set with three attributes, =description=, =inputs=, and =outputs=.  Here are
some highlights from the =flake.nix= of our scaffolded project:

#+begin_src nix :eval no :noweb yes
{
    description = "A foundation to build Nix-based projects from.";
    inputs = {
        flake-compat    = { url = "github:edolstra/flake-compat"; flake = false; };
        flake-parts.url = "github:hercules-ci/flake-parts";
        nix-project.url = "github:shajra/nix-project";
        nixpkgs.url     = "github:NixOS/nixpkgs/nixos-<<get("nixos-latest")>>";
    };
    outputs = inputs@{ flake-parts, nix-project, ... }:
        # …
    ;
}
#+end_src

The =description= is just a simple textual string.

=inputs= specifies all the dependencies needed by our project. Many of these
dependencies could well be flakes themselves. Others might be pointers to online
files. Most of these inputs are specified in a URI syntax. See the [[nix-flake-inputs][official
documentation on flake references]] for more details.

The scaffolded project has four dependencies:
- [[nix-flake-compat][=flake-compat=]], to support users not using flakes (=nix/compat.nix=)
- [[nix-flake-parts][=flake-parts=]], for an improved ergonomic experience when defining flake outputs.
- =nix-project= (this project), for document generation (=support/docs-generations=)
- [[nixpkgs][=nixpkgs=]], a central library for Nix almost all packages build off of

The =outputs= attribute is where we specify what our flake provides. We define
it as a function. The head of this function is an attribute set mapping input
names to their respective outputs. The function's body returns an attribute set
of everything our flake provides.

Note that what is specified in =inputs= describes how to get our dependencies,
but this is different from the inputs supplied to the =outputs= function, which
are the dependencies themselves.

Nix does not strictly enforce the schema of the outputs returned by =outputs=
function. However, some attributes are special with respect to defaults searched
by various =nix= subcommands. You can run =nix flake check= to see that your
flake passes basic checks, including warnings for any outputs not recognized as
standard.

The official Nix documentation doesn't yet have a specification of all standard
outputs in one place. The Nix wiki, though, has a [[nix-flake-outputs][useful section on outputs]].

** System-specific flake outputs

Flakes, by design, disallow the build platform from being queried, even to see
which chipset we will be building on. This restriction ensures some portability
and reproducibility, but introduces some complexity when defining and accessing
flake outputs. For every package, a flake must provide a different output for
each system supported.

Flake outputs end up with attribute paths like
- ~packages.<system>.<name>~ (how most flakes output packages)
- ~legacyPackages.<system>.<attribute path>~ (how [[nixpkgs][Nixpkgs]] outputs packages)

You can see all the systems used by Nix with the following command:

#+name: platforms
#+begin_src sh :results output silent :exports code
nix eval nixpkgs#lib.platforms.all
#+end_src

