doc/project-developing.md
- [About this document](#sec-1)
- [Prerequisites](#sec-2)
- [Scaffolding](#sec-3)
- [Authoring flakes](#sec-4)
  - [Overview of `flake.nix`](#sec-4-1)
  - [System-specific flake outputs](#sec-4-2)
  - [Authoring flake outputs with `flake-parts`](#sec-4-3)
  - [Overlays](#sec-4-4)
  - [Making applications with `callPackage`](#sec-4-5)
- [Updating dependencies](#sec-5)
- [Next Steps](#sec-6)


# About this document<a id="sec-1"></a>

This document shows how to get started managing a software project using the following in conjunction:

-   the [Nix package manager](https://nixos.org/nix)
-   an experimental feature of Nix called [flakes](https://nixos.wiki/wiki/Flakes)
-   this project, Nix-project.

Nix-project provides library support that helps ease the ergonomics of using Nix with flakes.

> **<span class="underline">NOTE:</span>** To understand more about why to use an experimental feature such as flakes, as well as known trade-offs, please read the provided [supplemental documentation on Nix](nix-introduction.md).

Nix-project uses all the features it provides itself, so you can look through this repository for concrete examples of how to do what's discussed in this document.

# Prerequisites<a id="sec-2"></a>

If you're new to Nix consider reading the provided [introduction](nix-introduction.md).

If you don't have Nix set up yet, see the provided [installation and configuration guide](nix-installation.md). You will need Nix's experimental flakes feature enabled to continue following this development guide.

If you don't know how to use basic Nix commands, see the provided [usage guide](nix-usage-flakes.md).

If you're new to the Nix programming language, see the provided [language tutorial](nix-language.md).

# Scaffolding<a id="sec-3"></a>

Nix-project provides a template you can use to scaffold a new project. This scaffold captures recommended conventions also used by Nix-project itself.

If you want to scaffold a new project set up similarly, you can go into a writable directory and invoke the following `nix` call:

```sh
nix --extra-experimental-features nix-command \
    --refresh run github:shajra/nix-project/main#nix-scaffold \
    -- --target-dir /tmp/my-project  # or whereever you like
```

    SUCCESS: Scaffolded Nix project at /tmp/my-project

The `--refresh` assures that you get the latest version of the scaffolding script from the internet if you've made this `nix run` invocation before.

In the freshly scaffolded project, you'll see the following files:

    my-project
    ├── default.nix
    ├── flake.nix
    ├── nix
    │   ├── compat.nix
    │   ├── my-app.nix
    │   └── overlay.nix
    ├── README.org
    └── support
        └── docs-generate

`README.org` and `support/docs-generate` are used to document your project and are discussed in [another document](project-documenting.md).

`default.nix` and `nix/compat.nix` provide non-flakes support for users of your project who have decided not to enable flakes in their Nix installation. These are static files that you shouldn't typically have to modify. They expose the flake defined in `flake.nix` as a Nix expression of packages. The provided [guide on using Nix without flakes](nix-usage-noflakes.md) illustrates how end users without flakes can use the `default.nix` and `nix/compat.nix` files in the scaffolded project. The [guide on using Nix with flakes](nix-usage-flakes.md) will match other user's experience.

You'll modify the top-level `flake.nix` file and the Nix files under the `nix` directory (with exception of `compat.nix`) to customize the scaffolded project to your needs.

# Authoring flakes<a id="sec-4"></a>

As documented in the provided [introduction to Nix](nix-introduction.md), we're using the experimental flakes feature of Nix for a few reasons:

-   more assurances of a deterministic and reproducible build
-   faster evaluation from improved caching
-   an improved ergonomic experience for authors of Nix projects
-   an improved ergonomic experience for end users consuming Nix projects

## Overview of `flake.nix`<a id="sec-4-1"></a>

The best way to start understanding a flakes-based project is to read the `flake.nix` file at the project's root. This file is written in the Nix programming language. See the provided [introduction to the Nix language](nix-language.md) if you're new to the language.

Every `flake.nix` file must conform to a standard structure of an attribute set with three attributes, `description`, `inputs`, and `outputs`. Here are some highlights from the `flake.nix` of our scaffolded project:

```nix
{
    description = "A foundation to build Nix-based projects from.";
    inputs = {
        flake-compat    = { url = "github:edolstra/flake-compat"; flake = false; };
        flake-parts.url = "github:hercules-ci/flake-parts";
        nix-project.url = "github:shajra/nix-project";
        nixpkgs.url     = "github:NixOS/nixpkgs/nixos-25.05";
    };
    outputs = inputs@{ flake-parts, nix-project, ... }:
        # …
    ;
}
```

The `description` is just a simple textual string.

`inputs` specifies all the dependencies needed by our project. Many of these dependencies could well be flakes themselves. Others might be pointers to online files. Most of these inputs are specified in a URI syntax. See the [official documentation on flake references](https://nixos.org/manual/nix/stable/command-ref/new-cli/nix3-flake.html#flake-references) for more details.

The scaffolded project has four dependencies:

-   [`flake-compat`](https://github.com/edolstra/flake-compat), to support users not using flakes (`nix/compat.nix`)
-   [`flake-parts`](https://github.com/hercules-ci/flake-parts), for an improved ergonomic experience when defining flake outputs.
-   `nix-project` (this project), for document generation (`support/docs-generations`)
-   [`nixpkgs`](https://github.com/NixOS/nixpkgs), a central library for Nix almost all packages build off of

The `outputs` attribute is where we specify what our flake provides. We define it as a function. The head of this function is an attribute set mapping input names to their respective outputs. The function's body returns an attribute set of everything our flake provides.

Note that what is specified in `inputs` describes how to get our dependencies, but this is different from the inputs supplied to the `outputs` function, which are the dependencies themselves.

Nix does not strictly enforce the schema of the outputs returned by `outputs` function. However, some attributes are special with respect to defaults searched by various `nix` subcommands. You can run `nix flake check` to see that your flake passes basic checks, including warnings for any outputs not recognized as standard.

The official Nix documentation doesn't yet have a specification of all standard outputs in one place. The Nix wiki, though, has a [useful section on outputs](https://nixos.wiki/wiki/Flakes#Output_schema).

## System-specific flake outputs<a id="sec-4-2"></a>

Flakes, by design, disallow the build platform from being queried, even to see which chipset we will be building on. This restriction ensures some portability and reproducibility, but introduces some complexity when defining and accessing flake outputs. For every package, a flake must provide a different output for each system supported.

Flake outputs end up with attribute paths like

-   `packages.<system>.<name>` (how most flakes output packages)
-   `legacyPackages.<system>.<attribute path>` (how [Nixpkgs](https://github.com/NixOS/nixpkgs) outputs packages)

You can see all the systems used by Nix with the following command:

```sh
nix eval nixpkgs#lib.platforms.all
```
