doc/project-developing.md

## Authoring flake outputs with `flake-parts`<a id="sec-4-3"></a>

Raw flakes are an improvement over not using them, but using flakes without library assistance requires some requisite boilerplate. The scaffold pulls in [`flake-parts`](https://github.com/hercules-ci/flake-parts) reduce this boilerplate with

-   an improved DSL for defining the `outputs` attribute
-   a *flake modules* framework to allow users to extend the DSL.

Below is the fully general way of entering the `flake-parts` DSL:

You should eventually read the [official `flake-parts` documentation](https://flake.parts), but we'll cover an introduction here.

```nix
{
    # …
    outputs = inputs@{ flake-parts, ... }:
        flake-parts.lib.mkFlake { inherit inputs; } (topLevelModArgs: {
            # …
        });
}
```

Note that bindings we have in scope include our dependencies (bound to `inputs` above) and `flake-parts` top-level module arguments (bound to the `topLevelModArgs` attribute set above). These are [documented fully in the `flake-parts` documentation](https://flake.parts/module-arguments.html).

If you don't need the top-level arguments when defining your outputs, you can call `flake-parts` with a more straightforward form (though our scaffolded project uses top-level arguments):

```nix
{
    # …
    outputs = inputs@{ flake-parts, ... }:
        flake-parts.lib.mkFlake { inherit inputs; } {
            # …
        };
}
```

As you can see from the scaffolded `flake.nix` file, `flake-parts` has us populate three attributes:

-   `systems`, a list of all the systems to build for
-   `perSystem`, a function evaluated for each system from `systems` that returns system-specific output.
-   `flake`, for outputs that pass through as raw flakes outputs

In practice, this looks something like the following:

```nix
{
    # …
    outputs = inputs@{ flake-parts, ... }:
        flake-parts.lib.mkFlake { inherit inputs; } (topLevelModArgs: {
            systems = [
                # …
            ];
            perSystem = perSystemModArgs: {
                # …
            };
            flake = {
                # …
            };
        });
}
```

In `flake-parts`, the `flake` attribute is used for flake outputs that are the same for all target systems. The `flake` component of the attribute path is dropped. For example, in our scaffolded project, `flake.overlays.build` ends up being just `overlays.build` in our project's final output.

Otherwise, all our system-specific outputs are returned by the function we set for the `perSystem` attribute. Notice the `perSystem` function has the following three bindings in scope:

-   the original flake inputs (`inputs` above)
-   top-level module arguments (`topLevelModArgs` above)
-   per-system module arguments (`perSystemModArgs` above)

The per-system module arguments are also [documented fully in the flake-parts documentation](https://flake.parts/module-arguments.html). These arguments help us avoid dealing with the system we're targeting.

For example, one of the per-system arguments is `pkgs`. If you use this argument, you are expected to have Nixpkgs bound as an input to the specially treated `nixpkgs` name.

For example, let's say we wanted to pass through GNU Hello as a package provided by our project. Without `flake-parts` we could do the following:

```nix
{
    description = "Without flake-parts";
    inputs = {
        nixpkgs.url = "github:NixOS/nixpkgs/nixos-25.05";
    };
    outputs = inputs: {
        packages.x86_64-linux.my-hello  =
            inputs.nixpkgs.legacyPackages.x86_64-linux.hello;
        packages.aarch64-darwin.my-hello =
            inputs.nixpkgs.legacyPackages.aarch64-darwin.hello;
    };
}
```

This example not using `flake-parts` may not seem that bad when just passing through a package. But we end up with a lot of boilerplate if we wanted to factor out code common code for building a package. It could look as obtuse as the following:

```nix
{
    description = "Motivating flake-parts";
    inputs = {
        nixpkgs.url = "github:NixOS/nixpkgs/nixos-25.05";
    };
    outputs = inputs:
        let lib = inputs.nixpkgs.lib;
            systems = [ "x86_64-linux" "aarch64-darwin" ];
            build = system: {
                ${system}.my-hello =
                    inputs.nixpkgs.legacyPackages.${system}.hello;
            };
            packages =
                lib.foldr lib.recursiveUpdate {} (map build systems);
        in { inherit packages; };
}
```

Notice how annoying it is to deal with the `system` parameter. Here's what the same flake looks like with `flake-parts`:

```nix
{
    description = "Illustrating flake-parts";
    inputs = {
        flake-parts.url = "github:hercules-ci/flake-parts";
        nixpkgs.url = "github:NixOS/nixpkgs/nixos-25.05";
    };
    outputs = inputs@{ flake-parts, ... }:
        flake-parts.lib.mkFlake { inherit inputs; } {
            systems = [ "x86_64-linux" "aarch64-darwin" ];
            perSystem = { pkgs, ... }: {
                packages.my-hello = pkgs.hello;
            };
        };
}
```

Hopefully, the improvement in this DSL is appreciable upon inspection. We don't have to mess with a parameterization for the system. And merging everything for each system is done for us.

In the example above, rather than accessing the `hello` package from the `inputs.nixpkgs` parameter, we get it from the per-system module argument `pkgs`, which looks for `inputs.nixpkgs` by name, and selects out the appropriate `legacyPackages` for whatever system we're targeting (one of those listed in `systems`).

Additionally, in our `perSystem` we set a `packages.my-hello` attribute, and the final outputs we get in our flake are:

-   `packages.x86_64-linux.my-hello`
-   `packages.aarch64-darwin.my-hello`

See the [official flake-parts documentation](https://flake.parts/module-arguments.html) for more per-system module arguments available beyond `pkgs`. Particularly useful is `inputs'`, which can be traversed just like `inputs`, but ignoring the system component of the attribute path. So, though a little more verbose, we could use `inputs'` instead of `pkgs` as follows:

```nix
{
    description = "Illustrating flake-parts";
    inputs = {
        flake-parts.url = "github:hercules-ci/flake-parts";
        nixpkgs.url = "github:NixOS/nixpkgs/nixos-25.05";
    };
    outputs = inputs@{ flake-parts, ... }:
        flake-parts.lib.mkFlake { inherit inputs; } {
            systems = [ "x86_64-linux" "aarch64-darwin" ];
            perSystem = { inputs', ... }: {
                packages.my-hello = inputs'.nixpkgs.legacyPackages.hello;
            };
        };
}
```
