doc/project-developing.md

## Overlays<a id="sec-4-4"></a>

The scaffolded project provides a perspective on structuring the Nix expressions to build your flake. Nixpkgs is a giant tree that is mainly made of packages. Instances of Nixpkgs can be extended with special functions called *overlays*.

An overlay has the following form:

```nix
final: prev: {
    # new attributes to be merged into Nixpkgs
}
```

We start with an instance of Nixpkgs, and can chain overlays:

```nix
(nixpkgs.extend overlay1).extend overlay2
```

The `prev` parameter of the overlay allows us to access the version of Nixpkgs the overlay is directly extending. The `final` parameter enables us to access the version of Nixpkgs we'll get when all overlays have been applied.

For those familiar, `final` is the kind of open recursion we get with the `self` or `this` parameter in object-oriented (OO) languages. Similarly `prev` is like `super`. Similar to OO languages, we can use overlays to override packages referenced from `final` in any other overlay. References from `prev` can only be overridden by previous overlays. Overriding is powerful because we can override *all* references to a dependency. Overriding all references helps keep everything in our Nixpkgs instance on the same version for consistency and compatibility.

A typical pattern is to start with Nixpkgs, and extend it with more packages via overlays, until we finally have packages we want to distribute.

The scaffolded project has a `nix/overlay.nix` file that defines the overlay distributed by its flake:

```nix
withSystem: final: prev:
let
  inherit (prev.stdenv.hostPlatform) system;
in
withSystem system (
  { inputs', ... }:
  {
    nix-project-org2gfm = inputs'.nix-project.packages.org2gfm;
    my-app = final.callPackage ./my-app.nix { };
  }
)
```

This generator of an overlay takes a `withSystem` function as an argument. We get `withSystem` as a top-level module argument from `flake-parts`. `withSystem` allows access to the `inputs'` attribute set specialized to a specific platform. Within our overlay, we assume that Nixpkgs has already been specialized to a specific platform, which we can get from `prev.stdenv.hostPlatform.system`.

Additionally, the overlay defines a small application using the `callPackage` function from Nixpkgs. This is discussed in the next section.

Remember, another overlay can override anything in Nixpkgs or provided by a previous overlay. If building a package involves building some intermediate artifacts, you might want to expose those artifacts in the distributed overlay. Distributing overlays enables others to use the overlay and override these intermediate artifacts to get a different build.

## Making applications with `callPackage`<a id="sec-4-5"></a>

The scaffolded project contains the definition of an application in `nix/my-app.nix`, which has been written in a conventional style:

```nix
{
  writeShellApplication,
  curl,
  w3m,
}:

writeShellApplication {
  name = "my-app";
  runtimeInputs = [
    curl
    w3m
  ];
  text = ''
    curl -s 'https://nixos.org' | w3m -dump -T text/html
  '';
}
```

The attribute set input of this function expects dependencies passed in and returns the derivation of a package. All these dependencies happen to exist in a default instance of Nixpkgs:

-   `writeShellApplication` is a Nixpkgs utility to make a package providing a simple shell script.
-   `curl` is the standard cURL program that can download HTTP content.
-   `w3m` is a text-based web browser.

We could pass in these dependencies explicitly, but if there are many dependencies this can get tedious. Nixpkgs comes with a utility function `callPackage` that will

-   inspect (using reflection) the attribute names of the set input of a function
-   call the function passing in values retrieved from Nixpkgs with these names.

Some people recognize this kind of utility as *dependency injection*. The `callPackage` utility accepts two arguments:

1.  the function (or path to a Nix file evaluating to it) with dependencies to be injected
2.  an attribute set to overlay on top of Nixpkgs when looking up dependencies.

Using `final.callPackage`, various packages that depend on one another can be defined in the same overlay. Here's an example:

```nix
final: prev: {
    my-app-a = final.callPackage ({writeShellApplication}: …) {};
    my-app-b = final.callPackage ({writeShellApplication, my-app-a}: …) {};
    my-app-c = final.callPackage ({writeShellApplication, my-app-a, my-app-b}: …) {};
}
```

Here `my-app-a` is a simple shell script that doesn't rely on anything more than shell. `my-app-b` is a script that uses `my-app-a`. And `my-app-c` is a script that uses both `my-app-a` and `my-app-b`. Notice that for these second two `callPackage` calls, we can not use `prev.callPackage`, because dependencies required wouldn't exist until this overlay was applied to Nixpkgs.

# Updating dependencies<a id="sec-5"></a>

You'll notice the first time you run a `nix` command against your newly scaffolded project, a `flake.lock` lock file will be generated. Flake inputs can point to mutable references like Git repository branches. The lock file pins references to a specific snapshot retrieved.

This lock file should be checked in with your source. This file is what makes your build repeatable.

When we want to update all the dependencies in our lock file, we can run:

```sh
nix flake update
```

# Next Steps<a id="sec-6"></a>

This guide and the scaffolded project used as an example, show how to make packages providing a simple shell script. You will likely want to start making packages for other languages.

Nix has an [official learning starting point](https://nixos.org/learn.html), that is a good next step. In particular, you will find yourself reading the [Nixpkgs manual](https://nixos.org/nixpkgs/manual).

The guides included in this project cover more of the language-agnostic aspects of Nix and Nixpkgs. Each programming language ecosystem has its set of unique requirements and idiosyncrasies. Nixpkgs provide functions to assist with each language, which can lead to some divergent experiences when packaging and developing with Nix. The Nixpkgs manual has [dedicated sections for each language](https://nixos.org/manual/nixpkgs/stable/#chap-language-support). Eventually, you will find yourself diving into [Nixpkgs source code](https://github.com/NixOS/nixpkgs).

The Nix ecosystem is vast. This project and documentation illustrate just a small sample of what Nix can do.
